PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f8722.inc
_CP2_ON_5L           EQU  H'FB'    ; Block 2 (008000-00BFFFh) code-protected
_CP2_OFF_5L          EQU  H'FF'    ; Block 2 (008000-00BFFFh) not code-protected

_CP3_ON_5L           EQU  H'F7'    ; Block 3 (00C000-00FFFFh) code-protected
_CP3_OFF_5L          EQU  H'FF'    ; Block 3 (00C000-00FFFFh) not code-protected

_CP4_ON_5L           EQU  H'EF'    ; Block 4 (010000-013FFFh) code-protected
_CP4_OFF_5L          EQU  H'FF'    ; Block 4 (010000-013FFFh) not code-protected

_CP5_ON_5L           EQU  H'DF'    ; Block 5 (014000-017FFFh) code-protected
_CP5_OFF_5L          EQU  H'FF'    ; Block 5 (014000-017FFFh) not code-protected

_CP6_ON_5L           EQU  H'BF'    ; Block 6 (01BFFF-018000h) code-protected
_CP6_OFF_5L          EQU  H'FF'    ; Block 6 (01BFFF-018000h) not code-protected

_CP7_ON_5L           EQU  H'7F'    ; Block 7 (01C000-01FFFFh) code-protected
_CP7_OFF_5L          EQU  H'FF'    ; Block 7 (01C000-01FFFFh) not code-protected

;----- CONFIG5H Options --------------------------------------------------
_CPB_ON_5H           EQU  H'BF'    ; Boot Block (000000-0007FFh) code-protected
_CPB_OFF_5H          EQU  H'FF'    ; Boot Block (000000-0007FFh) not code-protected

_CPD_ON_5H           EQU  H'7F'    ; Data EEPROM code-protected
_CPD_OFF_5H          EQU  H'FF'    ; Data EEPROM not code-protected

;----- CONFIG6L Options --------------------------------------------------
_WRT0_ON_6L          EQU  H'FE'    ; Block 0 (000800, 001000 or 002000-003FFFh) write-protected
_WRT0_OFF_6L         EQU  H'FF'    ; Block 0 (000800, 001000 or 002000-003FFFh) not write-protected

_WRT1_ON_6L          EQU  H'FD'    ; Block 1 (004000-007FFFh) write-protected
_WRT1_OFF_6L         EQU  H'FF'    ; Block 1 (004000-007FFFh) not write-protected

_WRT2_ON_6L          EQU  H'FB'    ; Block 2 (008000-00BFFFh) write-protected
_WRT2_OFF_6L         EQU  H'FF'    ; Block 2 (008000-00BFFFh) not write-protected

_WRT3_ON_6L          EQU  H'F7'    ; Block 3 (00C000-00FFFFh) write-protected
_WRT3_OFF_6L         EQU  H'FF'    ; Block 3 (00C000-00FFFFh) not write-protected

_WRT4_ON_6L          EQU  H'EF'    ; Block 4 (010000-013FFFh) write-protected
_WRT4_OFF_6L         EQU  H'FF'    ; Block 4 (010000-013FFFh) not write-protected

_WRT5_ON_6L          EQU  H'DF'    ; Block 5 (014000-017FFFh) write-protected
_WRT5_OFF_6L         EQU  H'FF'    ; Block 5 (014000-017FFFh) not write-protected

_WRT6_ON_6L          EQU  H'BF'    ; Block 6 (01BFFF-018000h) write-protected
_WRT6_OFF_6L         EQU  H'FF'    ; Block 6 (01BFFF-018000h) not write-protected

_WRT7_ON_6L          EQU  H'7F'    ; Block 7 (01C000-01FFFFh) write-protected
_WRT7_OFF_6L         EQU  H'FF'    ; Block 7 (01C000-01FFFFh) not write-protected

;----- CONFIG6H Options --------------------------------------------------
_WRTC_ON_6H          EQU  H'DF'    ; Configuration registers (300000-3000FFh) write-protected
_WRTC_OFF_6H         EQU  H'FF'    ; Configuration registers (300000-3000FFh) not write-protected

_WRTB_ON_6H          EQU  H'BF'    ; Boot Block (000000-007FFF, 000FFF or 001FFFh) write-protected
_WRTB_OFF_6H         EQU  H'FF'    ; Boot Block (000000-007FFF, 000FFF or 001FFFh) not write-protected

_WRTD_ON_6H          EQU  H'7F'    ; Data EEPROM write-protected
_WRTD_OFF_6H         EQU  H'FF'    ; Data EEPROM not write-protected

;----- CONFIG7L Options --------------------------------------------------
_EBTR0_ON_7L         EQU  H'FE'    ; Block 0 (000800, 001000 or 002000-003FFFh) protected from table reads executed in other blocks
_EBTR0_OFF_7L        EQU  H'FF'    ; Block 0 (000800, 001000 or 002000-003FFFh) not protected from table reads executed in other blocks

_EBTR1_ON_7L         EQU  H'FD'    ; Block 1 (004000-007FFFh) protected from table reads executed in other blocks
_EBTR1_OFF_7L        EQU  H'FF'    ; Block 1 (004000-007FFFh) not protected from table reads executed in other blocks

_EBTR2_ON_7L         EQU  H'FB'    ; Block 2 (008000-00BFFFh) protected from table reads executed in other blocks
_EBTR2_OFF_7L        EQU  H'FF'    ; Block 2 (008000-00BFFFh) not protected from table reads executed in other blocks

_EBTR3_ON_7L         EQU  H'F7'    ; Block 3 (00C000-00FFFFh) protected from table reads executed in other blocks
_EBTR3_OFF_7L        EQU  H'FF'    ; Block 3 (00C000-00FFFFh) not protected from table reads executed in other blocks

_EBTR4_ON_7L         EQU  H'EF'    ; Block 4 (010000-013FFFh) protected from table reads executed in other blocks
_EBTR4_OFF_7L        EQU  H'FF'    ; Block 4 (010000-013FFFh) not protected from table reads executed in other blocks

_EBTR5_ON_7L         EQU  H'DF'    ; Block 5 (014000-017FFFh) protected from table reads executed in other blocks
_EBTR5_OFF_7L        EQU  H'FF'    ; Block 5 (014000-017FFFh) not protected from table reads executed in other blocks

_EBTR6_ON_7L         EQU  H'BF'    ; Block 6 (018000-01BFFFh) protected from table reads executed in other blocks
_EBTR6_OFF_7L        EQU  H'FF'    ; Block 6 (018000-01BFFFh) not protected from table reads executed in other blocks

_EBTR7_ON_7L         EQU  H'7F'    ; Block 7 (01C000-01FFFFh) protected from table reads executed in other blocks
_EBTR7_OFF_7L        EQU  H'FF'    ; Block 7 (01C000-01FFFFh) not protected from table reads executed in other blocks

;----- CONFIG7H Options --------------------------------------------------
_EBTRB_ON_7H         EQU  H'BF'    ; Boot Block (000000-007FFF, 000FFF or 001FFFh) protected from table reads executed in other blocks
_EBTRB_OFF_7H        EQU  H'FF'    ; Boot Block (000000-007FFF, 000FFF or 001FFFh) not protected from table reads executed in other blocks


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'

        LIST
